def area(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a (float): первая сторона прямоугольника
            b (float): вторая сторона прямоугольника
            (a и b - смежные стороны)

        Возвращаемое значение:
            area (float): площадь прямоугольника
    '''
    return a * b 

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.

        Параметры:
            a (float): первая сторона прямоугольника
            b (float): вторая сторона прямоугольника
            (a и b - смежные стороны)

        Возвращаемое значение:
            perimeter (float): периметр прямоугольника
    '''
    return (a + b) * 2 
